{"content": [{"file": "00.jpg", "text": "\nThe beef wellington needs the following ingredients\n\nA beef tenderloin filet (roughly 1lb)\n\nPuff Pastry\n\nMushrooms, half a pound\n\nParma ham (I used prosciutto instead)\n\nMustard (we used gochujang mustard)\n\nEgg wash (just whisk an egg or two with a touch of water added. I think maybe it was just supposed to be the yolk but I used the whole egg)\n\n"}, {"file": "01.jpg", "text": "\nTo start out we just want to sear the filet. Get some olive oil in the pan and turn up the heat as high as it goes. When your pan is heated up, just do a quick 30-45 seconds on each side for the sear.\n\n"}, {"file": "02.jpg", "text": "\nOnce seared, put the meat aside to rest\n\n"}, {"file": "03.jpg", "text": "\nWe want to brush the mustard over the beef. I did it after the meat rested for 10 minutes, but maybe it's better to do it before - I'm not sure\n\n"}, {"file": "04.jpg", "text": "\nWash your mushrooms, then get them into a food processor, or atleast dice them as finely as possible. Get them in the pan on medium/medium-high heat with a little oil for a good 10 minutes - the goal is to boil off all the moisture mushrooms naturally contain. When you take them out you should have something of a mushroom paste.\n\n"}, {"file": "05.jpg", "text": "\nGet your ham (or here, prosciutto - I didn't get enough)\n\n"}, {"file": "06.jpg", "text": "\nLay out some cling wrap\n\n"}, {"file": "07.jpg", "text": "\nMake a bed of ham then slather your mushroom paste across it\n\n"}, {"file": "08.jpg", "text": "\nPlace your beef in the middle of the bed then using the plastic wrap, roll it up and seal it as best you can. Chill in the fridge for 20 minutes\n\n"}, {"file": "09.jpg", "text": "\nGet out your puff pastry and roll out a sufficient amount to cover your beef. After your beef is chilled, unwrap and lay it on top of the puff pastry\n\n"}, {"file": "10.jpg", "text": "\nBrush egg wash around the puff pastry surrounding the beef. Then, roll up the pastry to seal in your beef and cut off any excess pastry. Sit it on the seam. Then, slather the wellington in more egg wash, and put in the fridge to chill for another 5-10 minutes.\n\n"}, {"file": "11.jpg", "text": "\nGet the wellington out of the fridge, slather in egg wash again, and season some rock salt on the top. Score with a knife to be fancy.\n\n"}, {"file": "12.jpg", "text": "\nBake it. Recommended time is 25-35 minutes for a medium rare, we went for 35 to be closer to the medium side. When you take it out, let it rest another 10 minutes.\n\n"}, {"file": "13.jpg", "text": "\nSlice it open and see the beautiful cook on it.\n\n"}, {"file": "14.jpg", "text": "\nSlices should be pretty large for this dish. We made our wellington into four slices. A little soggy on the bottom, but overall it was delicious.\n"}], "title": "Kurt's Beef Wellington attempt"}