{"content": [{"text": "\nHere's our meal for another day of the vegetarian challenge. Originally, this was a post of our kimchi recipe, but we decided to show the rest of the dinner which included\nan array of Asian themed dishes, and a bonus of matcha key lime pie (not actually Asian besides the Matcha component). \n\nIngredients\n\nKimchi - napa cabbage, daikon, lots of salt, green onion, apple, garlic, ginger, red pepper flakes, glutinous rice flour (or substitute), optional shiitake mushroom broth\nBuns - flour, yeast, water, sugar, optional condensed milk for dipping\nEggs - scrambled eggs and chopped green onion, salt to taste     \nEggplant - eggplant, soy sauce, black bean paste with chili, garlic, sesame oil\nMatcha key lime pie - limes, graham crackers, egg yolks, butter, optional matcha powder\n\n", "file": "00.jpg"}, {"text": "\nWe start off with the kimchi. Chop the napa cabbage (1/2 of a ~3lb cabbage used here). Salt the cabbage and let it sit for a few hours. \n\n", "file": "01.jpg"}, {"text": "\nChop some daikon and salt it. \n\n", "file": "02.jpg"}, {"text": "\nBlender together the base for the kimchi paste: half an apple, 4 cloves garlic, ~1 tablespoon ginger.\n\n", "file": "03.jpg"}, {"text": "\nDiced and salted daikons, this will be pickled separately from the cabbage kimchi. \n\n", "file": "04.jpg"}, {"text": "\nWhile vegetables are salting, make the glue for the kimchi paste. First, make the shiitake mushroom broth. \n\n", "file": "05.jpg"}, {"text": "\nRemove the mushrooms, and filter the broth to remove any particles. Thicken the broth with glutinuous rice flour (we didn't have any but we did have lotus flour, which worked just as well). \n\n", "file": "06.jpg"}, {"text": "\nVegetables should still be soaking in salt. Meanwhile, multitask by making some buns. This is just a simple yeast based dough that is partially risen and cut into 1 inch wide buns. \n\n", "file": "07.jpg"}, {"text": "\nAdd some oil to the pan, and allow the buns to finish rising in the pan.\n\n", "file": "08.jpg"}, {"text": "\nWash off the salt from the cabbage. \n\n", "file": "09.jpg"}, {"text": "\nGather the ingredients for making the kimchi paste. \n\n", "file": "10.jpg"}, {"text": "\nFirst, add the puree of apple, garlic and ginger. \n\n", "file": "11.jpg"}, {"text": "\nMushroom broth glue.\n\n", "file": "12.jpg"}, {"text": "\nGreen onions (about 3 chopped).\n\n", "file": "13.jpg"}, {"text": "\n1/2 - 3/4 cup red pepper powder.\n\n", "file": "14.jpg"}, {"text": "\nMix thoroughly.\n\n", "file": "15.jpg"}, {"text": "\nAdd shredded daikons. \n\n", "file": "16.jpg"}, {"text": "\nMix more. \n\n", "file": "17.jpg"}, {"text": "\nAdd ~1/3 of the paste to the chopped daikons for making the pickled daikons, along with 1 tablespoon sugar and 1 tablespoons of white vinegar. \n\n", "file": "18.jpg"}, {"text": "\nMix well.\n\n", "file": "19.jpg"}, {"text": "\nPack pickled daikons into jars. \n\n", "file": "20.jpg"}, {"text": "\nNow for the cabbage kimchi, squeeze as much water from the cabbage as possible and add to the remaining paste.\n\n", "file": "21.jpg"}, {"text": "\nMix well. \n\n", "file": "22.jpg"}, {"text": "\nA third experimental pickled cabbage. This one only has chopped and salted green cabbage, salt and water. \n\n", "file": "23.jpg"}, {"text": "\nThe buns should have risen fully by now. We will be pan-fried/steaming this at low heat. Keep the lid covered so the steam inside the pan will cook the buns, occassionally add little amounts of water. \n\n", "file": "24.jpg"}, {"text": "\nOur beautiful kimchi jars (two jars of pickled daikon, 1 jar of plain green cabbage, and 1 large tray of pickled napa cabbage). Keep this at room temperature for at least 24 hours before moving to the fridge. We couldn't resist eating so we took out a small portion of the napa cabbage kimchi for dinner. \n\n", "file": "25.jpg"}, {"text": "\nOur dinner, featuring the freshly made kimchi, some steamed eggplant, buns, and eggs. \n\n", "file": "26.jpg"}, {"text": "\nSteamed eggplant: Seasoning the garlic with salt and garlic. Steam eggplant for ~8 mins. The sauce consists of soy sauce, black bean chili paste, and sesame oil. \n\n", "file": "27.jpg"}, {"text": "\nFresh kimchi. \n\n", "file": "28.jpg"}, {"text": "\nScrambled eggs with scallions. Good for mixing into the buns.  \n\n", "file": "29.jpg"}, {"text": "\nPan fried/steamed buns. \n\n", "file": "30.jpg"}, {"text": "\nNow for dessert, a matcha key lime pie. For making the crust, we didn't have graham crackers but we did have teddy grahams. \n\n", "file": "31.jpg"}, {"text": "\nTwo limes, juiced. \n\n", "file": "32.jpg"}, {"text": "\nMatcha tea powder. \n\n", "file": "33.jpg"}, {"text": "\nCrush the teddy grahams with a rolling pin, about 1/2 cup. \n\n", "file": "34.jpg"}, {"text": "\nAdd butter (~4 tablespoons). This is the pie crust.\n\n", "file": "35.jpg"}, {"text": "\nAdd some matcha powder to the key juice. We added about 1/2 teaspoon but that turned out to be not enough to get the pie to change color.  \n\n", "file": "36.jpg"}, {"text": "\n1 can of sweetened condensed milk.\n\n", "file": "37.jpg"}, {"text": "\nAdd 3 egg yolks to the condensed milk and mix. \n\n", "file": "38.jpg"}, {"text": "\nAdd filtered lime/matcha juice.\n\n", "file": "39.jpg"}, {"text": "\nMix again.\n\n", "file": "40.jpg"}, {"text": "\nButter the bottom and sides of a pie tray, and pack the crust tightly. We had enough to make 2 small pies. \n\n", "file": "41.jpg"}, {"text": "\nAdd the pie filling. \n\n", "file": "42.jpg"}, {"text": "\nBake for 17 mins at 350 degrees. \n\n", "file": "43.jpg"}, {"text": "\nLet the pie chill for at least 2 hours. Optionally add matcha powder as topping. \n\n", "file": "44.jpg"}], "title": "Asian Dinner (kimchi, buns, eggs, eggplant, matcha key lime pie)"}