{"title": "Kurt and Amy Portland (Maine) trip!!", "content": [{"file": "00.jpg", "text": "\nOur first restaurant on the trip was \"Empire\", a dim sum restaurant. The first dish we got was cha shu pork, tasty and surprisingly sweet. I got it with a beer to celebrate being in Portland.\n\n"}, {"file": "01.jpg", "text": "\n\"Lobster dumplings\", but it didn't taste much different from shrimp. Still was good, just not specially lobster flavored.\n\n"}, {"file": "02.jpg", "text": "\nPork Potstickers. Mixed with water chestnut bits to make it crunchy. Was juicy. Very good.\n\n"}, {"file": "03.jpg", "text": "\nAfter eating at Empire, we grabbed a half dozen donuts from \"The Holy Donut\", a beloved tourist trap. It was worth it, as they had a bunch of really delicious donuts with interesting flavors. Unfortunately, they were out of stock of about half the flavors we had wanted even though it was still the middle of the day. The store was packed.\n\n"}, {"file": "04.jpg", "text": "\nFor dinner, we grabbed a seat outside at Eventide Oyster Co. We started off with oyster shooters (w/ the bloody Mary chasing). Great start to the meal.\n\n"}, {"file": "05.jpg", "text": "\nWe split this oyster slider appetizer. It was quite amazing. Each bite had a refreshing crunch from the pickled stuff on top, the deep savory flavor of the oyster and the nice steamed bun too.\n\n"}, {"file": "06.jpg", "text": "\nWe got to experience the authentic clam bake. Tasted quite good, had never had something like this where you clean the clams and such off as you're eating. It was a lot of food so we were both full after finishing it.\n\n"}, {"file": "07.jpg", "text": "\nAfter dinner we headed to the Liquid Riot Bottling Company to have some drinks and watch the sox game on their gigantic TV. We got beer flights, ranging from a double hoppy IPA, a normal IPA, a pilsner, and a porter. It was all pretty good, and Amy discovered she loves porters.\n\n"}, {"file": "08.jpg", "text": "\nAt the bar we tried their fish tacos. They were absolutely outstanding. Incredibly fresh.\n\n"}, {"file": "09.jpg", "text": "\nWe also got this mixed drink.\n\n"}, {"file": "10.jpg", "text": "\nBreakfast at Becky's diner the next morning. We love going to diners when we leave Boston because there's just not enough diners here.\n\n"}, {"file": "11.jpg", "text": "\nMore breakfast.\n\n"}, {"file": "12.jpg", "text": "\nMore breakfast.\n\n"}, {"file": "13.jpg", "text": "\nAfter breakfast, we took a lyft to the Portland Head lighthouse, one of the top landmarks in the city. Aside from the constant procession of cars comings and going, the lighthouse was really beautiful -- and there was a lobster roll food truck called \"Bite into Maine\" just out front, so we each grabbed one. Mine was the classic Maine style. It was delicious, as you'd expect.\n\n"}, {"file": "14.jpg", "text": "\nAmy's lobster roll was the curry style. Also good. The lobster was very tender and subtly sweet.\n\n"}, {"file": "15.jpg", "text": "\nFor dinner we went to Central Provisions. They told us there was a two hour wait for a table, but from reading Yelp Amy knew that the basement bar was first-come-first-serve so we checked out the bar and managed to snag a table just as someone else was leaving. Perfect timing! For our starter, we got this beet salad which was probably the best salad I've had in my entire life.\n\n"}, {"file": "16.jpg", "text": "\nA bone marrow toast. Incredible.\n\n"}, {"file": "17.jpg", "text": "\nThe \"suckling pig\". Meaty and tender, very crunchy on the outside, delicious with a great mouthfeel.\n\n"}, {"file": "18.jpg", "text": "\nOur final item, the skate wings. Also very tender, served with a perfect creamy citrusy sauce. Everything served with it was just perfect in combination.\n\n"}, {"file": "19.jpg", "text": "\nNext morning, we got breakfast at Marcy's Diner before leaving. It was only 8 or 9 am when we arrived, but they were already blasting heavy metal, so it was a great ambience. They suggested we try their muffin of the day, a pumpkin muffin, and it was worth it.\n\n"}, {"file": "20.jpg", "text": "\nMore breakfast food\n\n"}, {"file": "21.jpg", "text": "\nMore breakfast food"}]}