{"title": "Low-fat ramen", "content": [{"text": "\nIngredients\nEggs, mirin, soy sauce\nScallions\nPork loin roast, shiitake mushrooms\nChicken stock\nMinute miso\nFlour (all-purpose and/or bread flour)\nGarlic, sesame seeds, sesame oil\nNori\n\n", "file": "00.jpg"}, {"text": "\nBoil eggs. Heat pot of water until boiling. Add eggs and cook for 6:30 to 7 minutes depending on the size of the eggs.\nImmediately rinse the eggs under cold water to stop the cooking. Peel the egg shells. \n\n", "file": "01.jpg"}, {"text": "\nAdd 1:3 ratio of mirin to soy sauce to the eggs. Cover the bowl and and place in fridge to marinade. \nFlip the eggs occasionally (every half hour) to make sure all sides are evenly marinated. \nThese takes at least 2 hours to marinate so do this ahead of time. \n\n", "file": "02.jpg"}, {"text": "\nSesame garlic sauce: this is completely optional but it is a good topping to the ramen. \nHeat 1 tablespoon sesame oil, 1 teaspoon sesame seeds and 2 cloves of chopped garlic for ~2 minutes over low to medium heat. Be careful not to burn.\n\n", "file": "03.jpg"}, {"text": "\nChopped scallions.\n\n", "file": "04.jpg"}, {"text": "\nBraised pork loin roast. Sear pork and cook in the oven with garlic, shiitake mushrooms, scallions, 1 tablespoon soy sauce and 1 cup water at 325 degrees for 2 1/2 hours.\n\nUsually the traditional Japanese ramen recipes call for pork belly but this is a more low-fat alternative. \n\n", "file": "05.jpg"}, {"text": "\nHandmade noodles. For the dough, I use 1 cup all purpose floor and 1 cup bread flour, 1 egg, and about half cup water.\nSplit the dough in half and roll out each half. Repeat the process with the other half.\n\n", "file": "06.jpg"}, {"text": "\nFlip the dough onto itself a couple of times and slice with a knife. Then, stretch out each strand of noodle until the desired thickness. \n\n\n", "file": "07.jpg"}, {"text": "\nStretched noodles. This is one of two portions. \n\n", "file": "08.jpg"}, {"text": "\nBoil a pot of water, add salt to taste to the water, and cook the noodles for 4-5 minutes depending on the thickness of the noodles. \nThen, wash the noodles with cold water to remove the excess starch. \n\n", "file": "09.jpg"}, {"text": "\nAdd the marinated egg.\n\n", "file": "10.jpg"}, {"text": "\nAdd pork slices.\n\n", "file": "11.jpg"}, {"text": "\nAdd mushrooms, scallions, nori strips.\n\n", "file": "12.jpg"}, {"text": "\nAdd broth. \n\nFor the broth, traditional tonkotsu ramen broth is very time-consuming to make and requires lots of gelatinous meat and bones, and though delicious, is very heavy on calories. \n\nHere I make a very simple and quick broth using 1 1/2 cup chicken stock, 1 cup water, and 1 tablespoon minute miso. Boil broth for ~10 minutes. Add salt to taste. \n\n", "file": "13.jpg"}, {"text": "\nAdd a tablespoon of the pre-made sesame garlic topping.\n\nAnd we're done!\n", "file": "14.jpg"}]}
